files/foamCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

 
scale   1;

vertices
(

    ( -22.86  -22.86  -22.86 )
    ( 38.1  -22.86  -22.86 )
    ( 38.1  38.1  -22.86 )
    ( -22.86  38.1  -22.86 )
    ( -22.86  -22.86  27.432 )
    ( 38.1  -22.86  27.432 )
    ( 38.1  38.1  27.432 )
    ( -22.86  38.1  27.432 )
 
);

edges
(
);

blocks
(
        
hex (0 1 2 3 4 5 6 7) (83 83 25) simpleGrading (1 1 1)

);

boundary
(

    inlet
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }
    
    outlet
    {
        type wall;
        faces
        (
            (6 5 1 2)
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
            (4 5 6 7)
            (3 2 1 0)
        );
    }

);

mergePatchPairs
(
);
          


// ************************************************************************* //
