files/foamCase/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

 
dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 4e-06;

boundaryField
{
    ".*"
    {
        type            epsilonWallFunction;
        value           uniform 4e-06;
    }
    
}
            


// ************************************************************************* //
